src/cf/DataProcessors/ЗагрузкаНоменклатурыИзФайла.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаНоменклатурыИзФайла</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>110</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ЗагрузкаНоменклатурыИзФайла/Forms/ФормаВыбораЗаголовкаКолонки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дерево = РеквизитФормыВЗначение("Реквизиты");
	СтрокаДерева = Дерево.Строки.Добавить();
	СтрокаДерева.Имя = НСтр("ru = 'Наименование'");
	СтрокаДерева = Дерево.Строки.Добавить();
	СтрокаДерева.Имя = НСтр("ru = 'Уникальный идентификатор номенклатуры'");
	СтрокаДерева = Дерево.Строки.Добавить();
	СтрокаДерева.Имя = НСтр("ru = 'Артикул'");
	
	СтрокаДереваЦены = Дерево.Строки.Добавить();
	СтрокаДереваЦены.Имя = НСтр("ru = 'Цена'");
	
	ДоступныеТипыЦен = ПолучитьИзВременногоХранилища(Параметры.АдресСпискаТипыЦен);
	
	Для Каждого ОписаниеТипЦены Из ДоступныеТипыЦен Цикл
		
		ЗаполнитьЗначенияСвойств(СтрокаДереваЦены.Строки.Добавить(), ОписаниеТипЦены);
		
	КонецЦикла;
	
	ИспользоватьТипыЦен = ДоступныеТипыЦен.Количество() > 0;
	
	СтрокаДерева = Дерево.Строки.Добавить();
	СтрокаДерева.Имя = НСтр("ru = 'Единица измерения'");
	СтрокаДерева = Дерево.Строки.Добавить();
	СтрокаДерева.Имя = НСтр("ru = 'Ставка НДС'");
	ЗначениеВРеквизитФормы(Дерево,"Реквизиты");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработкаВыбора(Элементы.Реквизиты.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ОбработкаВыбора(Элементы.Реквизиты.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ДанныеТекущейСтроки)
	
	Если ИспользоватьТипыЦен И ДанныеТекущейСтроки.Имя = "Цена" Тогда
		Возврат;
	ИначеЕсли ИспользоватьТипыЦен И ДанныеТекущейСтроки.ИмяРодителя = "Цена" Тогда
		ИмяРеквизита = "Цена, " + ДанныеТекущейСтроки.Имя;
		СтруктураВозврат = Новый Структура("ИмяРеквизита, ЗначениеТипаЦен", ИмяРеквизита, ДанныеТекущейСтроки.Значение);
	Иначе
		СтруктураВозврат = Новый Структура("ИмяРеквизита", ДанныеТекущейСтроки.Имя);
	КонецЕсли;
	
	Закрыть(СтруктураВозврат);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ИспользоватьТипыЦен Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Элемент Из Реквизиты.ПолучитьЭлементы() Цикл
		Элементы.Реквизиты.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры
